       IDENTIFICATION DIVISION.
       PROGRAM-ID. blibrary.
       AUTHOR. ThomasD & Leocrabe225.
       DATE-WRITTEN. 03-06-2025 (fr).
       DATE-COMPILED. null.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.


       EXEC SQL INCLUDE SQLCA END-EXEC.

       PROCEDURE DIVISION.
           
           CALL "initdb".

           PERFORM 9900-DISCONNECT-SQL-BEGIN
              THRU 9900-DISCONNECT-SQL-END.

           STOP RUN.

       9900-DISCONNECT-SQL-BEGIN.
       EXEC SQL
           DISCONNECT ALL
       END-EXEC.
       9900-DISCONNECT-SQL-END.
