       IDENTIFICATION DIVISION.
       PROGRAM-ID. updtedit.
       AUTHOR. ThomasD & Leocrabe225.
       DATE-WRITTEN. 04-06-2025 (fr).
       DATE-COMPILED. null.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       EXEC SQL INCLUDE SQLCA END-EXEC.

       PROCEDURE DIVISION.

           EXIT PROGRAM.
           