       01 WS-CREATE-STRING    PIC X(10) VALUE "CREATE".
       01 WS-READ-STRING      PIC X(10) VALUE "READ".
       01 WS-UPDATE-STRING    PIC X(10) VALUE "UPDATE".
       01 WS-DELETE-STRING    PIC X(10) VALUE "DELETE".
       01 WS-QUIT-STRING      PIC X(10) VALUE "QUIT".