       01  :PREFIX:-RETURN-VALUE    PIC 9(01).
           88 :PREFIX:-RETURN-OK           VALUE 0.
           88 :PERFIX:-RETURN-NOT-FOUND    VALUE 1.
           88 :PREFIX:-RETURN-ERROR        VALUE 2.